

use teamproject1;

DROP TABLE IF EXISTS player;

CREATE TABLE player
(
	playerid	INT,
	name		VARCHAR(20),
	team		VARCHAR(10),
	playerposition	VARCHAR(10)
 	PRIMARY KEY 	(playerid)
);

INSERT INTO player VALUES
(101, '류현진', '한화', 'SP'),
(102, '김광현', 'SK', 'SP'),
(103, '정재훈', '두산', 'RP'),
(104, '윤석민', '기아', 'SP'),
(105, '오승환', '삼성', 'CP'),
(106, '정우람', 'SK', 'RP'),
(107, '나이트', '키움', 'SP'),
(108, '박희수', 'SK', 'RP'),
(109, '손승락', '키움', 'CP'),
(110, '찰리', 'NC', 'SP'),
(111, '봉중근', 'LG', 'CP'),
(112, '밴 헤켄', '키움', 'SP'),
(113, '밴 덴 헐크', '삼성', 'SP'),
(114, '한현희', '키움', 'RP'),
(115, '양현종', '기아', 'SP'),
(116, '해커', 'NC', 'SP'),
(117, '조상우', '키움', 'RP'),
(118, '헥터', '기아', 'SP'),
(119, '니퍼트', '두산', 'SP'),
(120, '임창민', 'NC', 'CP'),
(121, '장원준', '두산', 'SP'),
(122, '김진성', 'NC', 'RP'),
(123, '안지만', '삼성', 'RP'),
(124, '최충연', '삼성', 'RP'),
(125, '송은범', '한화', 'RP'),
(126, '윌슨', 'LG', 'SP'),
(127, '함덕주', '두산', 'CP'),
(128, '린드블럼', '두산', 'SP'),
(129, '고우석', 'LG', 'CP'),
(130, '하재훈', 'SK', 'CP'),
(131, '알칸타라', '두산', 'SP'),
(132, '주권', 'KT', 'RP'),
(133, '스트레일리', '롯데', 'SP'),
(134, '미란다', '두산', 'SP'),
(135, '정우영', 'LG', 'RP'),
(136, '고영표', 'KT', 'SP'),
(137, '원태인', '삼성', 'SP'),
(201, '이대호', '롯데', '3B'),
(202, '조인성', 'LG', 'C'),
(203, '김현수', '두산', 'LF'),
(204, '최형우', '삼성', 'LF'),
(205, '이용규', 'KIA', 'CF'),
(206, '이범호', 'KIA', '3B'),
(207, '강정호', '키움', 'SS'),
(208, '박석민', '삼성', '3B'),
(209, '김태균', '한화', '1B'),
(210, '최정', 'SK', '3B'),
(211, '손아섭', '롯데', 'RF'),
(212, '박용택', 'LG', 'CF'),
(213, '서건창', '키움', '2B'),
(214, '나바로', '삼성', '2B'),
(215, '나성범', 'NC', 'CF'),
(216, '테임즈', 'NC', '1B'),
(217, '유한준', '키움', 'RF'),
(218, '양의지', '두산', 'C'),
(219, '김재환', '두산', 'LF'),
(220, '황재균', '롯데', '3B'),
(221, '강민호', '롯데', 'C'),
(222, '박건우', '두산', 'CF'),
(223, '로사리오', '한화', '1B'),
(224, '버나디나', '한화', 'CF'),
(225, '박병호', '키움', '1B'),
(226, '전준우', '롯데', 'LF'),
(227, '러프', '삼성', '1B'),
(228, '김하성', '키움', 'SS'),
(229, '샌즈', '키움', 'RF'),
(230, '페르난데스', '두산', 'DH'),
(231, '로하스', 'KT', 'RF'),
(232, '터커', 'KIA', 'RF'),
(233, '이정후', '키움', 'RF'),
(234, '홍창기', 'LG', 'CF'),
(235, '강백호', 'KT', '1B'),
(236, '구자욱', '삼성', 'RF');

commit;

select * from player;
